<a href="https://colab.research.google.com/github/Fabricioti/Avaliacao_A2_quem_nao_faz_PI/blob/master/OlympicAthlete.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# • Avaliação A2 - Para quem não faz PI

# • Contexto

Este é um conjunto de dados históricos dos Jogos Olímpicos modernos, incluindo todos os Jogos de Atenas 1896 ao Rio 2016.
Foi utilizado o conjunto de dados do site: https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results. 

Nome do arquivo utilizado: (athlet_events.csv)

# • Conteúdo

O arquivo (athlet_events.csv) contém 271116 linhas e 15 colunas. Cada linha corresponde a um atleta individual competindo em um evento olímpico individual (eventos de atletas). As colunas são:

•	ID - número único para cada atleta

•	Nome - nome do atleta

•	Sexo - M ou F

•	Idade - Inteiro

•	Altura - em centímetros

•	Peso - em quilogramas

•	Equipe - Nome da equipe

•	NOC - Código Olímpico do Comitê Olímpico Nacional

•	Jogos - Ano e época

•	Ano - Inteiro

•	Temporada - verão ou inverno

•	Cidade - Cidade anfitriã

•	Esporte - Esporte

•	Evento - Evento

•	Medalha - Ouro, Prata, Bronze ou NA

# O objetivo

realizar uma análise exploratória dos dados olímpicos utilizando o conjunto de dados: (atleta_eventos.csv) site: https://www.kaggle.com/heesoo37/120-years-of-olympic-history-athletes-and-results e também em www.sports-reference.com são o resultado de uma quantidade incrível de pesquisas de um grupo de entusiastas da história olímpica e auto-proclamados 'estatistérios'.
Especificamente serão respondidas as seguintes questões de pesquisa:


1. Configuração do Ambiente.
2. Leitura dos Dados.
  
  2.1 Dados ausentes.
3. Qual o número de participantes por sexo?
4. Ano e a quantidade de atletas por cidades que sediaram as Olimpíadas?
5. Quantidade de atletas participantes por País?
6. Qual é o nome e o número de medalhas dos participantes?
7. Qual é a média de idades dos atletas?
8. Quantidade de atletas por idade?

##1. Configuração do Ambiente

1.1 Importe o pacote numpy com o nome np.

1.2 Importe o pacote pandas com o nome pd.

In [ ]:
import numpy as np
import pandas as pd

##2. Leitura dos Dados

In [ ]:
df = pd.read_csv('athlete_events.csv')

df.head()

   ID                      Name  ...                             Event  Medal
0   1                 A Dijiang  ...       Basketball Men's Basketball    NaN
1   2                  A Lamusi  ...      Judo Men's Extra-Lightweight    NaN
2   3       Gunnar Nielsen Aaby  ...           Football Men's Football    NaN
3   4      Edgar Lindenau Aabye  ...       Tug-Of-War Men's Tug-Of-War   Gold
4   5  Christine Jacoba Aaftink  ...  Speed Skating Women's 500 metres    NaN

[5 rows x 15 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [ ]:
df.describe()

                  ID            Age  ...         Weight           Year
count  271116.000000  261642.000000  ...  208241.000000  271116.000000
mean    68248.954396      25.556898  ...      70.702393    1978.378480
std     39022.286345       6.393561  ...      14.348020      29.877632
min         1.000000      10.000000  ...      25.000000    1896.000000
25%     34643.000000      21.000000  ...      60.000000    1960.000000
50%     68205.000000      24.000000  ...      70.000000    1988.000000
75%    102097.250000      28.000000  ...      79.000000    2002.000000
max    135571.000000      97.000000  ...     214.000000    2016.000000

[8 rows x 5 columns]

###2.1. Dados ausentes

In [ ]:
print('Possui Dados ausentes?', df.isnull().values.any())

print('total de dados ausentes: ', df.isnull().sum().sum())
print('total de dados ausentes por coluna: ', df.isnull().sum())

Possui Dados ausentes? True
total de dados ausentes:  363853
total de dados ausentes por coluna:  ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

###3. Qual o número de participantes por sexo?

In [ ]:
df['Sex'].value_counts()

df.groupby('Sex').Age.describe()

        count       mean       std   min   25%   50%   75%   max
Sex
F     74098.0  23.732881  5.795252  11.0  20.0  23.0  27.0  74.0
M    187544.0  26.277562  6.474972  10.0  22.0  25.0  29.0  97.0

###4. Ano e a quantidade de atletas por cidades que sediaram as Olimpíadas.

In [ ]:
cidades = pd.crosstab(df['City'], df['Year'])

print(cidades)

Year                    1896  1900  1904  1906  ...  2010   2012  2014   2016
City                                            ...
Albertville                0     0     0     0  ...     0      0     0      0
Amsterdam                  0     0     0     0  ...     0      0     0      0
Antwerpen                  0     0     0     0  ...     0      0     0      0
Athina                   380     0     0  1733  ...     0      0     0      0
Atlanta                    0     0     0     0  ...     0      0     0      0
Barcelona                  0     0     0     0  ...     0      0     0      0
Beijing                    0     0     0     0  ...     0      0     0      0
Berlin                     0     0     0     0  ...     0      0     0      0
Calgary                    0     0     0     0  ...     0      0     0      0
Chamonix                   0     0     0     0  ...     0      0     0      0
Cortina d'Ampezzo          0     0     0     0  ...     0      0     0      0
Garmisch-Partenkirchen     0     0     0     0  ...     0      0     0      0
Grenoble                   0     0     0     0  ...     0      0     0      0
Helsinki                   0     0     0     0  ...     0      0     0      0
Innsbruck                  0     0     0     0  ...     0      0     0      0
Lake Placid                0     0     0     0  ...     0      0     0      0
Lillehammer                0     0     0     0  ...     0      0     0      0
London                     0     0     0     0  ...     0  12920     0      0
Los Angeles                0     0     0     0  ...     0      0     0      0
Melbourne                  0     0     0     0  ...     0      0     0      0
Mexico City                0     0     0     0  ...     0      0     0      0
Montreal                   0     0     0     0  ...     0      0     0      0
Moskva                     0     0     0     0  ...     0      0     0      0
Munich                     0     0     0     0  ...     0      0     0      0
Nagano                     0     0     0     0  ...     0      0     0      0
Oslo                       0     0     0     0  ...     0      0     0      0
Paris                      0  1936     0     0  ...     0      0     0      0
Rio de Janeiro             0     0     0     0  ...     0      0     0  13688
Roma                       0     0     0     0  ...     0      0     0      0
Salt Lake City             0     0     0     0  ...     0      0     0      0
Sankt Moritz               0     0     0     0  ...     0      0     0      0
Sapporo                    0     0     0     0  ...     0      0     0      0
Sarajevo                   0     0     0     0  ...     0      0     0      0
Seoul                      0     0     0     0  ...     0      0     0      0
Sochi                      0     0     0     0  ...     0      0  4891      0
Squaw Valley               0     0     0     0  ...     0      0     0      0
St. Louis                  0     0  1301     0  ...     0      0     0      0
Stockholm                  0     0     0     0  ...     0      0     0      0
Sydney                     0     0     0     0  ...     0      0     0      0
Tokyo                      0     0     0     0  ...     0      0     0      0
Torino                     0     0     0     0  ...     0      0     0      0
Vancouver                  0     0     0     0  ...  4402      0     0      0

[42 rows x 35 columns]

###5. Quantidade de atletas participantes por País?

In [ ]:
df['Team'].value_counts()

United States    17847
France           11988
Great Britain    11404
Italy            10260
Germany           9326
                 ...
Marsouin-8           1
Sunrise              1
Lancet               1
Bonaparte            1
Jeannette-18         1
Name: Team, Length: 1184, dtype: int64

###6. Qual é o nome e o número de medalhas dos participantes?

In [ ]:
nomes_medalhas = pd.crosstab(df['Name'], df['Medal'])

print(nomes_medalhas)

Medal                         Bronze  Gold  Silver
Name
A. Albert                          0     1       0
A. Dubois                          1     0       1
A. Joshua "Josh" West              0     0       1
A. Lawry                           0     0       1
A. M. Woods                        0     0       1
...                              ...   ...     ...
va Rakusz                          1     0       1
va Risztov                         0     1       0
va Szkely (-Gyarmati)              0     1       1
ver Maximiliano David Banega       0     1       0
ystein Pettersen                   0     1       0

[28202 rows x 3 columns]

###7. Qual é a média de idades dos atletas?

In [ ]:
media_idades = df['Age'].mean()
print('Média de idade dos atletas: ', media_idades)

Média de idade dos atletas:  25.556898357297374

###8. Quantidade de atletas por idade?

In [ ]:
df['Age'].value_counts()

23.0    21875
24.0    21720
22.0    20814
25.0    19707
21.0    19164
        ...
81.0        2
10.0        1
97.0        1
96.0        1
84.0        1
Name: Age, Length: 74, dtype: int64